RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_adc.h
/*********************************************************************************************************//**
 * @file    ht32f5xxxx_adc.h
 * @version $Rev:: 7678         $
 * @date    $Date:: 2024-04-01 #$
 * @brief   The header file of the ADC library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __ht32f5XXXX_ADC_H
#define __ht32f5XXXX_ADC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @addtogroup ADC
  * @{
  */


/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup ADC_Exported_Constants ADC exported constants
  * @{
  */
#define IS_ADC(x)                               (x == HT_ADC0)

#define ONE_SHOT_MODE                           (0x00000000)
#define CONTINUOUS_MODE                         (0x00000002)
#if (LIBCFG_ADC_NO_DISCON_MODE)
#define IS_DISCONTINUOUS_MODE(x)                (0)
#else
#define DISCONTINUOUS_MODE                      (0x00000003)
#define IS_DISCONTINUOUS_MODE(x)                (x == DISCONTINUOUS_MODE)
#endif

#define IS_ADC_CONVERSION_MODE(REGULAR_MODE)    ((REGULAR_MODE == ONE_SHOT_MODE)   || \
                                                 (REGULAR_MODE == CONTINUOUS_MODE) || \
                                                 (IS_DISCONTINUOUS_MODE(REGULAR_MODE)))

#define ADC_CH_0                                (0)
#define ADC_CH_1                                (1)
#define ADC_CH_2                                (2)
#define ADC_CH_3                                (3)
#define ADC_CH_4                                (4)
#define ADC_CH_5                                (5)
#define ADC_CH_6                                (6)
#define ADC_CH_7                                (7)

#define IS_ADC_CHANNEL1(CHANNEL)                (((CHANNEL) == ADC_CH_0) || ((CHANNEL) == ADC_CH_1) || \
                                                 ((CHANNEL) == ADC_CH_2) || ((CHANNEL) == ADC_CH_3) || \
                                                 ((CHANNEL) == ADC_CH_4) || ((CHANNEL) == ADC_CH_5) || \
                                                 ((CHANNEL) == ADC_CH_6) || ((CHANNEL) == ADC_CH_7))

#if (LIBCFG_ADC_CH8_9)
#define ADC_CH_8                                (8)
#define ADC_CH_9                                (9)
#define IS_ADC_CHANNEL2(CHANNEL)                (((CHANNEL) == ADC_CH_8) || ((CHANNEL) == ADC_CH_9))
#elif (LIBCFG_ADC_CH8_11)
#define ADC_CH_8                                (8)
#define ADC_CH_9                                (9)
#define ADC_CH_10                               (10)
#define ADC_CH_11                               (11)
#define IS_ADC_CHANNEL2(CHANNEL)                (((CHANNEL) == ADC_CH_8) || ((CHANNEL) == ADC_CH_9) || \
                                                 ((CHANNEL) == ADC_CH_10) || ((CHANNEL) == ADC_CH_11))
#else
#define IS_ADC_CHANNEL2(CHANNEL)                (0)
#endif

#if (LIBCFG_ADC_CH12_15)
#define ADC_CH_12                               (12)
#define ADC_CH_13                               (13)
#define ADC_CH_14                               (14)
#define ADC_CH_15                               (15)
#define IS_ADC_CHANNEL3(CHANNEL)                (((CHANNEL) == ADC_CH_12) || ((CHANNEL) == ADC_CH_13) || \
                                                 ((CHANNEL) == ADC_CH_14) || ((CHANNEL) == ADC_CH_15))
#else
#define IS_ADC_CHANNEL3(CHANNEL)                (0)
#endif

#if defined(USE_HT32F50020_30)
#define ADC_CH_BANDGAP                          (12)
#define ADC_CH_MVDDA                            (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_BANDGAP) || ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F50220_30)
#define ADC_CH_GND_VREF                         (12)
#define ADC_CH_VDD_VREF                         (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F50231_41)
#define ADC_CH_GND_VREF                         (12)
#define ADC_CH_VDD_VREF                         (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F52220_30)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F52231_41)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

