RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_adc.h
#if defined(USE_HT32F52243_53)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F52331_41)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F52342_52)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F52344_54)
#define ADC_CH_IVREF                            (15)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_MVDDA                            (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_GND_VREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F52357_67)
#define ADC_CH_VDD_VREF                         (12)
#define ADC_CH_DAC0_CH1                         (13)
#define ADC_CH_DAC0_CH0                         (14)
#define ADC_CH_IVREF                            (15)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_MVDDA                            (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_VDD_VREF) || \
                                                 ((CH) == ADC_CH_DAC0_CH1) || \
                                                 ((CH) == ADC_CH_DAC0_CH0) || \
                                                 ((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_GND_VREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F57331_41)
#define ADC_CH_VDD_VREF                         (12)
#define ADC_CH_IVREF                            (15)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_MVDDA                            (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_VDD_VREF) || \
                                                 ((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_GND_VREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F57342_52)
#define ADC_CH_VDD_VREF                         (12)
#define ADC_CH_DAC0_CH1                         (13)
#define ADC_CH_DAC0_CH0                         (14)
#define ADC_CH_IVREF                            (15)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_MVDDA                            (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_VDD_VREF) || \
                                                 ((CH) == ADC_CH_DAC0_CH1) || \
                                                 ((CH) == ADC_CH_DAC0_CH0) || \
                                                 ((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_GND_VREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F0006)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F61244_45)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F50343)
#define ADC_CH_MVDDA                            (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F5826)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_VDD_VREF                         (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || ((CH) == ADC_CH_VDD_VREF))
#endif

#if defined(USE_HT32F54231_41)
#define ADC_CH_GND_VREF                         (10)
#define ADC_CH_VDD_VREF                         (11)
#define ADC_CH_IVREF                            (12)
#define ADC_CH_MVDDA                            (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || \
                                                 ((CH) == ADC_CH_VDD_VREF) || \
                                                 ((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F54243_53)
#define ADC_CH_GND_VREF                         (10)
#define ADC_CH_VDD_VREF                         (11)
#define ADC_CH_IVREF                            (12)
#define ADC_CH_MVDDA                            (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_GND_VREF) || \
                                                 ((CH) == ADC_CH_VDD_VREF) || \
                                                 ((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F67041_51)
#define ADC_CH_IVREF                            (15)
#define ADC_CH_GND_VREF                         (16)
#define ADC_CH_MVDDA                            (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_GND_VREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F52234_44)
#define ADC_CH_DAC0_CH0                         (12)
#define ADC_CH_DAC0_CH1                         (13)
#define ADC_CH_DAC1_CH0                         (14)
#define ADC_CH_DAC1_CH1                         (15)
#define ADC_CH_IVREF                            (16)
#define ADC_CH_MVDDA                            (17)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_DAC0_CH0) || \
                                                 ((CH) == ADC_CH_DAC0_CH1) || \
                                                 ((CH) == ADC_CH_DAC1_CH0) || \
                                                 ((CH) == ADC_CH_DAC1_CH1) || \
                                                 ((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F53231_41)
#define ADC_CH_IVREF                            (12)
#define ADC_CH_MVDDA                            (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F53242_52)
#define ADC_CH_IVREF                            (12)
#define ADC_CH_MVDDA                            (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F50431_41)
#define ADC_CH_IVREF                            (12)
#define ADC_CH_MVDDA                            (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#if defined(USE_HT32F50442_52)
#define ADC_CH_IVREF                            (12)
#define ADC_CH_MVDDA                            (13)
#define IS_ADC_CH_INTERNAL1(CH)                 (((CH) == ADC_CH_IVREF) || \
                                                 ((CH) == ADC_CH_MVDDA))
#endif

#define IS_ADC_CHANNEL(CHANNEL)                  (IS_ADC_CHANNEL1(CHANNEL) || \
                                                  IS_ADC_CHANNEL2(CHANNEL) || \
                                                  IS_ADC_CHANNEL3(CHANNEL) || \
                                                  IS_ADC_CH_INTERNAL1(CHANNEL))

#define IS_ADC_INPUT_CHANNEL(CHANNEL)           (IS_ADC_CHANNEL1(CHANNEL) || IS_ADC_CHANNEL2(CHANNEL) || IS_ADC_CHANNEL3(CHANNEL))


#define ADC_TRIG_SOFTWARE                       (1UL << 0)

#if (LIBCFG_ADC_SW_TRIGGER_ONLY)
#define IS_ADC_TRIG(REGTRIG)                    ((REGTRIG) == ADC_TRIG_SOFTWARE)
#else
/* ((ADCTCR[4] << 4) | (ADCTSR[20] << 20))                                                                  */
#if (LIBCFG_CMP)
#define ADC_TRIG_CMP0                           ((1UL << 4) | (0UL << 20))
#define ADC_TRIG_CMP1                           ((1UL << 4) | (1UL << 20))
#endif

/* ((ADCTCR[3] << 3) | (ADCTSR[23:22] << 22) | (ADCTSR[19] << 19))                                          */
#define ADC_TRIG_BFTM0                          ((1UL << 3) | (0UL << 22) | (0UL << 19))
#if (LIBCFG_BFTM1)
#define ADC_TRIG_BFTM1                          ((1UL << 3) | (0UL << 22) | (1UL << 19))
#endif

/* ((ADCTCR[3] << 3) | (ADCTSR[29:27]) << 27) | (ADCTSR[23:22] << 22) | (ADCTSR[19] << 19))                 */
#if (LIBCFG_PWM0)
#define ADC_TRIG_PWM0_MTO                       ((1UL << 3) | (0UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH0O                      ((1UL << 3) | (1UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH1O                      ((1UL << 3) | (2UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH2O                      ((1UL << 3) | (3UL << 27) | (1UL << 22) | (0UL << 19))
#define ADC_TRIG_PWM0_CH3O                      ((1UL << 3) | (4UL << 27) | (1UL << 22) | (0UL << 19))
#endif
#if (LIBCFG_PWM1)
#define ADC_TRIG_PWM1_MTO                       ((1UL << 3) | (0UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH0O                      ((1UL << 3) | (1UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH1O                      ((1UL << 3) | (2UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH2O                      ((1UL << 3) | (3UL << 27) | (1UL << 22) | (1UL << 19))
#define ADC_TRIG_PWM1_CH3O                      ((1UL << 3) | (4UL << 27) | (1UL << 22) | (1UL << 19))
#endif

/* ((ADCTCR[2] << 2) | (ADCTSR[26:24] << 24) | (ADCTSR[18:16] << 16))                                       */
#if (LIBCFG_MCTM0)
#define ADC_TRIG_MCTM0_MTO                      ((1UL << 2) | (0UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH0O                     ((1UL << 2) | (1UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH1O                     ((1UL << 2) | (2UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH2O                     ((1UL << 2) | (3UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH3O                     ((1UL << 2) | (4UL << 24) | (0UL << 16))
#endif

#if (LIBCFG_NO_GPTM0)
#define IS_ADC_TRIG_GPTM0(x)                    (0)
#else
#define ADC_TRIG_GPTM0_MTO                      ((1UL << 2) | (0UL << 24) | (2UL << 16))
#define ADC_TRIG_GPTM0_CH0O                     ((1UL << 2) | (1UL << 24) | (2UL << 16))
#define ADC_TRIG_GPTM0_CH1O                     ((1UL << 2) | (2UL << 24) | (2UL << 16))
#define ADC_TRIG_GPTM0_CH2O                     ((1UL << 2) | (3UL << 24) | (2UL << 16))
#define ADC_TRIG_GPTM0_CH3O                     ((1UL << 2) | (4UL << 24) | (2UL << 16))

#define IS_ADC_TRIG_GPTM0(x)                    (((x) == ADC_TRIG_GPTM0_MTO)  || \
                                                 ((x) == ADC_TRIG_GPTM0_CH0O) || \
                                                 ((x) == ADC_TRIG_GPTM0_CH1O) || \
                                                 ((x) == ADC_TRIG_GPTM0_CH2O) || \
                                                 ((x) == ADC_TRIG_GPTM0_CH3O))
#endif

#if (LIBCFG_GPTM1)
#define ADC_TRIG_GPTM1_MTO                      ((1UL << 2) | (0UL << 24) | (3UL << 16))
#define ADC_TRIG_GPTM1_CH0O                     ((1UL << 2) | (1UL << 24) | (3UL << 16))
#define ADC_TRIG_GPTM1_CH1O                     ((1UL << 2) | (2UL << 24) | (3UL << 16))
#define ADC_TRIG_GPTM1_CH2O                     ((1UL << 2) | (3UL << 24) | (3UL << 16))
#define ADC_TRIG_GPTM1_CH3O                     ((1UL << 2) | (4UL << 24) | (3UL << 16))
#endif

/* (ADCTCR[1] << 1) | (ADCTSR[11:8] << 8)                                                                   */
#define ADC_TRIG_EXTI_0                         ((1UL << 1) | ( 0UL << 8))
#define ADC_TRIG_EXTI_1                         ((1UL << 1) | ( 1UL << 8))
#define ADC_TRIG_EXTI_2                         ((1UL << 1) | ( 2UL << 8))
#define ADC_TRIG_EXTI_3                         ((1UL << 1) | ( 3UL << 8))
#define ADC_TRIG_EXTI_4                         ((1UL << 1) | ( 4UL << 8))
#define ADC_TRIG_EXTI_5                         ((1UL << 1) | ( 5UL << 8))
#define ADC_TRIG_EXTI_6                         ((1UL << 1) | ( 6UL << 8))
#define ADC_TRIG_EXTI_7                         ((1UL << 1) | ( 7UL << 8))
#define ADC_TRIG_EXTI_8                         ((1UL << 1) | ( 8UL << 8))
#define ADC_TRIG_EXTI_9                         ((1UL << 1) | ( 9UL << 8))
#define ADC_TRIG_EXTI_10                        ((1UL << 1) | (10UL << 8))
#define ADC_TRIG_EXTI_11                        ((1UL << 1) | (11UL << 8))
#define ADC_TRIG_EXTI_12                        ((1UL << 1) | (12UL << 8))
#define ADC_TRIG_EXTI_13                        ((1UL << 1) | (13UL << 8))
#define ADC_TRIG_EXTI_14                        ((1UL << 1) | (14UL << 8))
#define ADC_TRIG_EXTI_15                        ((1UL << 1) | (15UL << 8))

#define IS_ADC_TRIG(REGTRIG)                    (IS_ADC_TRIG1(REGTRIG) || \
                                                 IS_ADC_TRIG2(REGTRIG) || \
                                                 IS_ADC_TRIG3(REGTRIG) || \
                                                 IS_ADC_TRIG4(REGTRIG) || \
                                                 IS_ADC_TRIG5(REGTRIG) || \
                                                 IS_ADC_TRIG6(REGTRIG) || \
                                                 IS_ADC_TRIG7(REGTRIG))

#define IS_ADC_TRIG1(REGTRIG)                   (IS_ADC_TRIG_GPTM0(REGTRIG)         || \
                                                 ((REGTRIG) == ADC_TRIG_BFTM0)      || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_0)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_1)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_2)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_3)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_4)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_5)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_6)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_7)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_8)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_9)     || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_10)    || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_11)    || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_12)    || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_13)    || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_14)    || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_15)    || \
                                                 ((REGTRIG) == ADC_TRIG_SOFTWARE))

#if (LIBCFG_BFTM1)
#define IS_ADC_TRIG2(REGTRIG)                   ((REGTRIG) == ADC_TRIG_BFTM1)
#else
#define IS_ADC_TRIG2(REGTRIG)                   (0)
#endif

#if (LIBCFG_MCTM0)
#define IS_ADC_TRIG3(REGTRIG)                   (((REGTRIG) == ADC_TRIG_MCTM0_MTO)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH0O) || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH1O) || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH2O) || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH3O) || \
                                                 ((REGTRIG) == ADC_TRIG_BFTM1))
#else
#define IS_ADC_TRIG3(REGTRIG)                   (0)
#endif

#if (LIBCFG_GPTM1)
#define IS_ADC_TRIG4(REGTRIG)                   (((REGTRIG) == ADC_TRIG_GPTM1_MTO)  || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM1_CH0O) || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM1_CH1O) || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM1_CH2O) || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM1_CH3O))
#else
#define IS_ADC_TRIG4(REGTRIG)                   (0)
#endif

